In [2]:
import pandas as pd
import numpy as np

### Filtering

In [29]:
df = pd.DataFrame({'A': 'foo bar foo bar foo bar foo foo'.split(),
                   'B': 'one one two three two two one three'.split(),
                   'C': np.arange(8), 'D': np.arange(8) * 2})
print(df)

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [30]:
# column equals a value
print(df.loc[df['A'] == 'foo'])

     A      B  C   D
0  foo    one  0   0
2  foo    two  2   4
4  foo    two  4   8
6  foo    one  6  12
7  foo  three  7  14

In [36]:
# column does not equal a value
print(df.loc[df['A'] != 'foo'])

         A  C   D
B
one    bar  1   2
three  bar  3   6
two    bar  5  10

In [31]:
# greater than or equal -- number
print(df.loc[df['C'] >= 6])

     A      B  C   D
6  foo    one  6  12
7  foo  three  7  14

In [32]:
# greater than or equal -- string
print(df.loc[df['B'] >= 's'])

     A      B  C   D
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
7  foo  three  7  14

In [33]:
# column is in a list of values
print(df.loc[df['B'].isin(['one','three'])])

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
3  bar  three  3   6
6  foo    one  6  12
7  foo  three  7  14

In [34]:
# or, set B to the index for easier reference
df = df.set_index(['B'])
df.loc[df.index.isin(['one','two'])]

       A  C   D
B
one  foo  0   0
one  bar  1   2
two  foo  2   4
two  foo  4   8
two  bar  5  10
one  foo  6  12

In [44]:
# column is NOT in list of values
print(df.loc[~df['A'].isin(['foo','three'])])

         A  C   D
B
one    bar  1   2
three  bar  3   6
two    bar  5  10

In [35]:
# combine multiple conditions with &:
df.loc[(df['C'] >= 2) & (df['D'] <= 8)]

         A  C  D
B
two    foo  2  4
three  bar  3  6
two    foo  4  8

In [ ]:
# combine multiple conditions with & -- string
df.loc[(df['C'] >= 2) & (df['D'] <= 8)]

In [45]:
# or refer to cols with dots
df[(df.A == 'foo') | (df.D == 4)]

         A  C   D
B
one    foo  0   0
two    foo  2   4
two    foo  4   8
one    foo  6  12
three  foo  7  14

In [47]:
# .query method (slower for smaller datasets)
df.query('A == "foo"')

         A  C   D
B
one    foo  0   0
two    foo  2   4
two    foo  4   8
one    foo  6  12
three  foo  7  14

In [48]:
# fast, using numpy where
df.iloc[np.where(df.A.values=='foo')]

         A  C   D
B
one    foo  0   0
two    foo  2   4
two    foo  4   8
one    foo  6  12
three  foo  7  14